//---------------------------------------
//担当者：尾花真理子
//内容：カメラの追従
//---------------------------------------

using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class CameraControl : MonoBehaviour
{
    // プレイヤーのゲームオブジェクトを保持
    public GameObject player;

    // プレイヤーとカメラの位置関係を保持
    private Vector3 offset;

    //------------------------------------------------------------------------------------------------------
    //* 初期化処理 *
    //------------------------------------------------------------------------------------------------------
    void Start()
    {
        // ゲームスタート時でのプレイヤーとカメラの位置関係を記憶
        offset = transform.position - player.transform.position;
    }
    //------------------------------------------------------------------------------------------------------

    //------------------------------------------------------------------------------------------------------
    // *更新処理*
    //------------------------------------------------------------------------------------------------------
    void Update()
    {
        
    }

    //------------------------------------------------------------------------------------------------------
    // *更新処理の後にされる処理*
    //------------------------------------------------------------------------------------------------------
    void LateUpdate()   // すべてのゲームオブジェクトのUpdateメソッドが呼び出された後に実行される関数
    {
        // プレイヤーの現在位置から新しいカメラの位置を作成
        Vector3 vector = player.transform.position + offset;
        // 縦方向は固定
       // vector.y = transform.position.y;
        // カメラの位置を移動
        transform.position = vector;

    }


}
