//----------------------------------------------------------------
// 担当者：藤原昂祐
// 内容　：クリスタルのスコアを表示する
//----------------------------------------------------------------

using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using TMPro;

public class CrystalScore : MonoBehaviour
{
    //=================================================
    // - 変数 -

    [Header("クリスタルの欠片の数を表示するテキスト")]
    [SerializeField] TextMeshProUGUI crystalText;// 表示するテキスト

    int score; // スコア

    //=================================================
    // - 更新処理 -

    void Update()
    {
        //---------------------------------------------
        // 表示するテキストを更新する
        crystalText.text = "crystal:" + score;
        //---------------------------------------------
    }

    //=================================================
}
